app/controllers/activities_controller.rb

    def show
        @activities = Activity.all
---
SELECT `activities`.* FROM `activities`

    def get_activities
		viewer = nil
		viewer = User.find_by_id(params[:user_id]) if (params.has_key?(:user_id))

        @activities = Activity.getActivitiesBy2(params[:category_id], params[:user_id])
		(0...@activities.length).each {|ndx| @activities[ndx].viewer = viewer}
---
SELECT `activities`.* FROM `activities` WHERE `activities`.`category_id` IS NULL AND `activities`.`user_id` IS NULL

    def get_activity
		viewer = nil
		viewer = User.find_by_id(params[:user_id]) if (params.has_key?(:user_id))

        @activity = Activity.find(params[:activity_id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT 1  [["id", "2"]]

    def vote_on
        if Vote.voteOn(params[:activity_id], params[:user_id], params[:rating])
			@activity = Activity.find(params[:activity_id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT 1  [["id", 1]]