app/controllers/activity_controller.rb

    def show
        @activities = Activity.all
---
SELECT `activities`.* FROM `activities`