app/controllers/users_controller.rb

    def login
        user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1