app/controllers/users_controller.rb

    def get_profile
        id = params[:id]
		user = User.find_by_id(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1