app/controllers/user_controller.rb

    def index
        @user1 = User.first
---
SELECT `users`.* FROM `users` ORDER BY `users`.`id` DESC LIMIT 1