app/controllers/vote_controller.rb

SELECT `votes`.* FROM `votes` ORDER BY `votes`.`id` DESC LIMIT 1
---
    def index
        @vote1 = Vote.first